NguyenVanThinhDiverT/Logic-Design-Project-STM32-Expansion-Shield/STM32IDE/Digital_Clock/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define UP_Pin GPIO_PIN_0
#define UP_GPIO_Port GPIOA
#define DOWN_Pin GPIO_PIN_1
#define DOWN_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define MODE_Pin GPIO_PIN_4
#define MODE_GPIO_Port GPIOA
#define LED_9_Pin GPIO_PIN_5
#define LED_9_GPIO_Port GPIOA
#define LED_8_Pin GPIO_PIN_6
#define LED_8_GPIO_Port GPIOA
#define LED_7_Pin GPIO_PIN_7
#define LED_7_GPIO_Port GPIOA
#define LED_4_Pin GPIO_PIN_8
#define LED_4_GPIO_Port GPIOA
#define LED_5_Pin GPIO_PIN_9
#define LED_5_GPIO_Port GPIOA
#define LED_0_Pin GPIO_PIN_10
#define LED_0_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define LED_1_Pin GPIO_PIN_3
#define LED_1_GPIO_Port GPIOB
#define LED_3_Pin GPIO_PIN_4
#define LED_3_GPIO_Port GPIOB
#define LED_2_Pin GPIO_PIN_5
#define LED_2_GPIO_Port GPIOB
#define LED_6_Pin GPIO_PIN_6
#define LED_6_GPIO_Port GPIOB
#define LED_11_Pin GPIO_PIN_8
#define LED_11_GPIO_Port GPIOB
#define LED_10_Pin GPIO_PIN_9
#define LED_10_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
